export default {
  language: 'Мова',
  ddos: {
    description: 'Атака DDoS робить величезну кількість запитів на ворожі сайти, чим спричиняє їхню величезну завантаженість і виводить їх з ладу. В наслідку атаки DDoS, сервери не можуть працювати в штатному режимі / лагають, або взагалі не працюють. Деталі тут: https://help-ukraine-win.com/',
    coordinators: 'Для координацій цілей: https://discord.gg/7BfJ9JKQ98 ',
    counter: {
      attackedTimes: 'Атаковано разів:',
      currentTarget: 'Теперішня ціль:'
    },
    enable: {
      name: 'Атака DDoS',
      description: 'Вмикає атаку DDoS по основним системам ворога: урядові сайти, банківські системи, пропагандиські пабліки, тощо. Поточні цілі атаки відображаються на сторінці'
    },
    proxy: {
      name: 'Атакувати тільки через проксі',
      description: 'З атакою без проксі, програма зможе використовувати ваш реальний IP. Це дозволяє робити атаки більш ефективними, але водночас зробить ваш IP відомим ворогу'
    },
    advanced: {
      header: 'Розширені налаштування',
      description: 'Якщо якась термінологія вам незрозуміла нічого не змінюйте. Це може призвести до негативного ефекту та знизити якість работи',
      masDosersCount: {
        name: 'Рівень паралелизму',
        description: 'Визначає кількість паралельних процесів. Додаток покладається на асинхронні операції (не паралельні через потоки), завдяки цьому CPU/RAM не перевантажуються. Після налаштування зазвичай потрібно близько 10 секунд, щоб застосувались зміни.'
      }
    },
    update: {
      title: 'Оновлення доступне',
      cancel: 'Відміна',
      confirm: 'Встановити оновлення'
    }
  }
}
