export default {
  language: 'Мова',
  main: {
    ddos: {
      ip: {
        name: 'Твоє IP'
      },
      enable: {
        name: 'Атака DDoS',
        description: 'Вмикає атаку DDoS по основних ресурсах ворога: урядові сайти, банківські системи, пропагандистські ресурси, тощо. Поточні цілі відображються на сторінці.'
      },
      proxy: {
        name: 'Атакувати тільки через проксі (низька ефективність)',
        description: 'Під час атаки без проксі, програма зможе використовувати реальну IP-адресу Вашого компʼютера. Це дозволить зробити атаку більш ефективною, але водночас Ваша IP-адреса буде видима ворогові. Щоб приховати адресу, використовуйте VPN.'
      },
      advanced: {
        automaticMode: {
          name: 'Автоматичний режим',
          description: 'Коли включений, програма аналізує свою ефективність і автоматично вибирає рівень паралельності.'
        },
        masDosersCount: {
          name: 'Кількість потоків',
          description: 'Задає кількість паралельних процесів. Використовуються асинхронні механізми (не потокові), тому це не сильно впливає на CPU/RAM. Після зміни, треба почекати ~10 cекунд поки стартують додаткові паралельні досери'
        }
      },
      update: {
        title: 'Оновлення доступне',
        cancel: 'Скасувати',
        confirm: 'Встановити оновлення'
      }
    },
    settings: {
      title: 'Налаштування',
      language: 'Мова',
      autoLaunch: {
        title: 'Автоматичний запуск (Windows / MacOS)',
        description: 'Запускати програму при старті компютера'
      },
      logRequests: {
        title: 'Логувати запити',
        description: 'Записувати статус кожного запиту до логу'
      },
      logTimestamp: {
        title: 'Логувати час',
        description: 'Записувати час разом з кожним повідомленням в логу'
      },
      autoUpdate: {
        title: 'Автоматичне оновлення',
        description: 'Не питати чи хочу я оновитися. Просто оновити і перезапустити програму!'
      },
      minimizeToTray: {
        title: 'Сховати до трею',
        description: 'Замість замикання програми сховати її в панелі задач'
      }
    },
    session: {
      session: 'Сесія',
      timesAttacked: 'Атаковано разів',
      efficiency: 'Ефективність',
      incomingTraffic: 'Вхідний трафік',
      outgoingTraffic: 'Вихідний трафік',
      currentTarget: 'Теперіщня ціль',
      requestsPerMinute: 'Запитів в хвилину'
    },
    statistics: {
      totalAttacks: 'загальна кількість атак',
      rank: {
        name: 'Звання',
        description: 'Виконуйте більше атак щоб отримати вище звання. Звання рахується тільки на підставі вдалих атак. (Клікніть на іконку щоб висвітлити всі звання)',
        level: {
          0: 'ПТН',
          1: 'Чмоня',
          2: 'Яник',
          3: 'Бульбаш',
          4: 'Гордон в шоколаді',
          5: 'Бджоли Ющенка',
          6: 'Доброволець',
          7: 'Джавелін',
          8: 'Банка з огiрками',
          9: 'С-300',
          10: 'NLAW',
          11: 'Байрактар',
          12: 'Український гопнік',
          13: 'Тероборона',
          14: 'Байден',
          15: 'Анджей Дуда',
          16: 'Еммануель Макрон',
          17: 'Борис Джонсон',
          18: 'Циган з трактором',
          19: 'Привид Києва',
          20: 'Віталій Кім',
          21: 'Степан Бaндера',
          22: 'Арестович',
          23: 'Залужний',
          24: 'Володимир Зеленський'
        }
      },
      currentThreads: 'Current threads'
    },
    news: {
      news: 'Новини'
    }
  }
}
