export default {
  language: 'Мова',
  ddos: {
    description: 'Атака DDOS робить величезну кількість запитів на ворожі сайти чим спричиняє їхню величезну загруженість і виводить з ладу. В наслідку атаки DDOS, сервери не можуть працювати в штатному режимі / лагають / або в загалі не працюють.',
    coordinators: 'Для координацій цілей https://t.me/incourse911 ',
    counter: {
      atackedTimes: 'Атаковано разів:',
      currentTarget: 'Теперішня ціль: '
    },
    enable: {
      name: 'Атака DDOS',
      description: 'Вмикає атаку DDOS по основним системам ворога: урядові сайти, банківські системи, пропагандиські пабліки, тощо. Поточні цілі атаки відображаються на сторінці.'
    },
    proxy: {
      name: 'Атакувати тільки через проксі',
      description: 'З атакою без проксі, програма зможе використовувати ваш реальний IP. Це дозволить зробити додаткові ефективні атаки, але водночас зробить ваш IP відомим ворогу.'
    },
    advanced: {
      header: 'Розширені налаштування',
      description: 'Якщо ви не досвідчений користувач і не розумієте частини понять, будь ласка не змінюйте розширених налаштувань. Це може навпаки погано вплинути на роботу програми',
      masDosersCount: {
        name: 'Рівень паралельності',
        description: 'Задає кількість паралельних процесів. Використовуються асинхронічні механізми (не потокові), тому це не сильно впливає на CPU/RAM. Після зміни, треба почекати ~ 10 cекунд поки стартують додаткові паралельні досери'
      }
    }
  }
}
