// This is just an example,
// so you can safely delete all default props below

export default {
  ddos: {
    description: 'Атака DDOS робить величезну кількість запитів на ворожі сайти чим спричиняє їхню величезну загруженість і виводить з ладу. В наслідку атаки DDOS, сервери не можуть працювати в штатному режимі / лагають / або в загалі не працюють.',
    coordinators: 'Для координацій цілей https://t.me/incourse911 ',
    counter: {
      atackedTimes: 'Атаковано разів:',
      currentTarget: 'Теперішня ціль: '
    },
    enable: {
      name: 'Атака DDOS',
      description: 'Вмикає атаку DDOS по основним системам ворога: урядові сайти, банківські системи, пропагандиські пабліки, тощо. Поточні цілі атаки відображаються на сторінці.'
    },
    proxy: {
      name: 'Атакувати тільки через проксі',
      description: 'З атакою без проксі, програма зможе використовувати ваш реальний IP. Це дозволить зробити додаткові ефективні атаки, але водночас зробить ваш IP відомим ворогу.'
    }
  }
}
