export default {
  language: 'Мова',
  ddos: {
    description: 'Атака DDoS робить величезну кількість запитів на ворожі сайти, чим спричиняє їхню величезну завантаженість і виводить їх з ладу. В наслідку атаки DDoS, сервери не можуть працювати в штатному режимі / лагають, або взагалі не працюють.',
    coordinators: 'Для координацій цілей: https://discord.gg/7BfJ9JKQ98 ',
    counter: {
      attackedTimes: 'Атаковано разів:',
      currentTarget: 'Теперішня ціль:'
    },
    enable: {
      name: 'Атака DDoS',
      description: 'Вмикає атаку DDoS по основним системам ворога: урядові сайти, банківські системи, пропагандиські пабліки, тощо. Поточні цілі атаки відображаються на сторінці'
    },
    proxy: {
      name: 'Атакувати тільки через проксі',
      description: 'З атакою без проксі, програма зможе використовувати ваш реальний IP. Це дозволяє робити атаки більш ефективними, але водночас зробить ваш IP відомим ворогу'
    },
    advanced: {
      header: 'Додаткові настройки',
      description: 'Не змінюйте, якщо не знаєте, що це значить. Зміна цих параметрів може мати негативний ефект на роботі додатку.',
      masDosersCount: {
        name: 'Рівень паралельності',
        description: 'Кількість процесів, що виконують атаку. Використання процесора та пам\`яті не має сильно змінитися, так як використовуються асинхронні операції. Зміна може зайняти до 10 секунд від моменту введення нового значення.'
      }
    },
    update: {
      title: 'Оновлення доступне',
      cancel: 'Відміна',
      confirm: 'Встановити оновлення'
    }
  }
}
