export default {
  language: 'Мова',
  layout: {
    header: {
      dashboard: 'Панель керування',
      ddos: 'DDoS',
      bruteforce: 'Brute force',
      bomber: 'Бомбер',
      statistics: 'Статистика',
      settings: 'Налаштування'
    },
    menu: {
      dashboard: {
        title: 'Панель керування',
        caption: 'Загальний статус програми'
      },
      ddos: {
        title: 'DDoS',
        caption: 'Атака Denial of service'
      },
      bruteforce: {
        title: 'Brute Force',
        caption: 'Взлом паролів противника'
      },
      bomber: {
        title: 'Бомбер',
        caption: 'Бомбардування телефонів через CМС та звінки'
      },
      statistics: {
        title: 'Статистика',
        caption: 'Моя статистика'
      },
      settings: {
        title: 'Налаштування',
        caption: 'Глобальні налаштування'
      }
    }
  },
  dashboard: {
    rank: {
      header: 'Твоє звання'
    },
    totalDDoSAtacks: {
      header: 'Загальна кількість DDoS атак'
    },
    currentWorkers: {
      header: 'Актуальна кількість DDoS потоків'
    },
    efficiency: {
      header: 'Ефективність DDoS',
      allTimeEfficiency: 'Ефективність за весь час',
      currentEfficiency: 'Актуальна ефективність',
      workers: 'Потоки'
    },
    requestsPerMinute: {
      header: 'Запитів в хвилину',
      failedRequests: 'Невдалі',
      successfullRequest: 'Вдалі',
      neutralRequests: 'Нейтральні (невідомо)'
    }
  },
  ddos: {
    description: 'Атака DDoS робить величезну кількість запитів на ворожі сайти і спричиняє їх надмірну завантаженість. Як наслідок, сервери не встигають обробляти всі запити, тому не можуть працювати в штатному режимі, лагають або взагалі не працюють. Деталі тут: https://help-ukraine-win.com.ua/',
    coordinators: 'Для координацій цілей: https://discord.gg/7BfJ9JKQ98 ',
    counter: {
      attackedTimes: 'Атаковано разів:',
      currentTarget: 'Теперішня ціль: '
    },
    efficiency: 'Ефективність',
    enable: {
      name: 'Атака DDoS',
      description: 'Вмикає атаку DDoS по основних ресурсах ворога: урядові сайти, банківські системи, пропагандистські ресурси, тощо. Поточні цілі відображються на сторінці.'
    },
    proxy: {
      name: 'Атакувати тільки через проксі',
      description: 'Під час атаки без проксі, програма зможе використовувати реальну IP-адресу Вашого компʼютера. Це дозволить зробити атаку більш ефективною, але водночас Ваша IP-адреса буде видима ворогові.'
    },
    advanced: {
      header: 'Розширені налаштування',
      description: 'Якщо ви недосвідчений користувач і не розумієте частини понять, будь ласка, не змінюйте розширених налаштувань. Це може погано вплинути на роботу програми.',
      maxWorkersCount: {
        name: 'Максимальна поточність',
        description: 'Максимально можлива кількість потоків'
      },
      automaticMode: {
        name: 'Автоматичний режим',
        description: 'Коли включений, програма аналізує свою ефективність і автоматично вибирає рівень паралельності.'
      },
      masDosersCount: {
        name: 'Кількість потоків',
        description: 'Задає кількість паралельних процесів. Використовуються асинхронні механізми (не потокові), тому це не сильно впливає на CPU/RAM. Після зміни, треба почекати ~10 cекунд поки стартують додаткові паралельні досери'
      },
      minimizeToTray: {
        name: 'Згорнути в трею',
        description: 'Додаток буде згорнуто в трей замість закриття'
      },
      runAtStartup: {
        name: 'Запуск автоматично при запуску ОС',
        description: 'Дозволити програмі запускатися автоматично під час запуску операційної системи'
      }
    },
    update: {
      title: 'Оновлення доступне',
      cancel: 'Відміна',
      confirm: 'Встановити оновлення'
    }
  },
  bomber: {
    header: 'Телефонний бомбер',
    description: 'Бомбер висилає велику кількість СМС та пробує зробити звінки на телефон жертви. Для цієї атаки обовязково потрібен включений VPN. Памятайте, що цей бомбер використовують одночасно тисячі осіб. Тому ефективнітсть може бути дуже малою',
    running: {
      title: 'Атака включена',
      caption: 'Включити виключити бомбера'
    },
    successFullAttacks: 'Вдалих атак: ',
    failedAttacks: 'Невдалих: '
  },
  statistics: {
    rank: {
      title: 'Звання',
      caption: 'Виконуйте більше атак щоб отримати вище звання. Звання рахується тільки на підставі вдалих атак.',
      level: {
        0: 'ПТН',
        1: 'Чмоня',
        2: 'Яник',
        3: 'Бульбаш',
        4: 'Гордон в шоколаді',
        5: 'Бджоли Ющенко',
        6: 'Доброволець',
        7: 'Джавелін',
        8: 'Банка з огiрками',
        9: 'С-300',
        10: 'NLAW',
        11: 'Байрактар',
        12: 'Український гопнік',
        13: 'Тероборона',
        14: 'Байден',
        15: 'Анджей Дуда',
        16: 'Еммануель Макрон',
        17: 'Борис Джонсон',
        18: 'Циган з трактором',
        19: 'Привид Києва',
        20: 'Віталій Кім',
        21: 'Степан Бaндера',
        22: 'Арестович',
        23: 'Залужний',
        24: 'Володимир Зеленський'
      }
    }
  },
  settings: {
    autoLaunch: {
      title: 'Автоматичний запуск (Windows / MacOS)',
      caption: 'Запускати програму при старті компютера'
    },
    logRequests: {
      title: 'Логувати запити',
      caption: 'Записувати статус кожного запиту до логу'
    },
    logTimestamps: {
      title: 'Логувати час',
      caption: 'Записувати час разом з кожним повідемленням в логу'
    },
    autoUpdate: {
      title: 'Автоматичне оновлення',
      caption: 'Не питати чи хочу я оновитися. Просто оновити і перезапустити програму!'
    },
    minimizeToTray: {
      title: 'Сховати до трею',
      caption: 'Замість замикання програми сховати її в панелі задач'
    }
  }
}
